In [241]:
import pandas as pd

# Carga de Datos

In [242]:
df_genero = pd.read_csv('DataPares/genero.csv')
df_pagos = pd.read_csv('DataPares/pagos.csv')
df_proveedores = pd.read_csv('DataPares/proveedores.csv')
df_subscripciones = pd.read_csv('DataPares/subscripciones.csv')
df_usuario_actividades = pd.read_csv('DataPares/usuario actividades.csv')
df_usuario_proveedor = pd.read_csv('DataPares/usuario proveedor.csv')
df_videojuego_genero = pd.read_csv('DataPares/videojuego genero.csv')
df_videojuego = pd.read_csv('DataPares/videojuego.csv')

# Visualización de Data's:

In [243]:
df_genero

                        genero                 subgenero
0                       Guerra                       NaN
1    Turn-based strategy (TBS)                       NaN
2                      Comedia                       NaN
3                        Drama                       NaN
4                       Sigilo                       NaN
5                   Estrategia                       NaN
6                    Platforma                       NaN
7                       Horror                  Thriller
8                   Historicos                       NaN
9                       Puzzle                       NaN
10                    Aventura                       NaN
11                      Accion                       NaN
12                   Simulador                       NaN
13                      Accion                       NaN
14                  Open world                       NaN
15                       Indie                       NaN
16                    Thriller                       NaN
17                     Negocio                       NaN
18                    Aventura                       NaN
19                    Tactical                       NaN
20  Hack and slash/Beat 'em up                       NaN
21                    Fantasia                       NaN
22                    Misterio                  Thriller
23                  Estrategia  Real Time Strategy (RTS)
24                         RPG                       NaN
25                         FPS                       NaN
26                     Sandbox                       NaN
27               Supervivencia                       NaN
28                      Accion                       NaN
29                         FPS                       NaN
30                    Misterio                       NaN
31             Ciencia Ficcion                       NaN

In [244]:
df_pagos.head()

,pago_id,monto,fecha,id_usuario,preorden,id_proveedor,id_videojuego,subs_id
0,4643,9100,12/5/2020,106,False,3.0,15.0,NaN
1,5081,9100,20/6/2021,82,False,3.0,15.0,NaN
2,5109,9100,5/1/2021,83,False,3.0,15.0,NaN
3,3961,9100,3/3/2021,125,False,3.0,15.0,NaN
4,4024,9100,16/10/2020,89,False,3.0,15.0,NaN

In [245]:
df_proveedores.head()

   id      nombre plataforma  id_videojuego   precio  precio_preorden
0   1  Epic Games         PC             16  32000.0              NaN
1   1  Epic Games         PC             18      NaN              NaN
2   1  Epic Games         PC             20      NaN              NaN
3   1  Epic Games         PC             21  39200.0          43120.0
4   1  Epic Games         PC             37  18000.0              NaN

In [246]:
df_subscripciones.head()

,id,estado,fecha_inicio,id_usuario,fecha_termino,id_videojuego,mensualidad
0,52,canceled,10/6/2020,127,8/7/2020,498,5000
1,335,canceled,17/6/2020,129,31/7/2020,731,9500
2,328,canceled,25/5/2020,78,1/8/2020,9630,5000
3,105,canceled,23/5/2020,93,8/9/2020,549,4000
4,74,canceled,17/7/2020,89,13/10/2020,126,6500

In [247]:
df_usuario_actividades.head()

,id_usuario,nombre,mail,password,username,id_videojuego,fecha v,cantidad,veredicto,titulo,texto,fecha_nacimiento
0,9,Jeffrey Aguirre,jaguirre@yahoo.it,dL1lawrd,jaguirre1971,15.0,13/05/2021,0.75,NaN,NaN,NaN,01/05/2009
1,9,Jeffrey Aguirre,jaguirre@yahoo.it,dL1lawrd,jaguirre1971,16.0,10/06/2020,1.50,NaN,NaN,NaN,28/01/2012
2,9,Jeffrey Aguirre,jaguirre@yahoo.it,dL1lawrd,jaguirre1971,37.0,04/02/2021,4.25,NaN,NaN,NaN,22/09/1979
3,9,Jeffrey Aguirre,jaguirre@yahoo.it,dL1lawrd,jaguirre1971,43.0,28/06/2021,52.00,NaN,NaN,NaN,06/04/1957
4,9,Jeffrey Aguirre,jaguirre@yahoo.it,dL1lawrd,jaguirre1971,71.0,20/01/2021,1.75,NaN,NaN,NaN,05/10/1951

In [248]:
df_usuario_proveedor.head()

   id_usuario  id_proveedor
0          90             4
1         115             3
2         134             3
3          47             5
4         117             1

In [249]:
df_videojuego_genero.head()

   id_videojuego     nombre
0           1164  Platforma
1            431   Aventura
2           1074     Accion
3           6036   Aventura
4           1985   Aventura

In [250]:
df_videojuego.head()

,id_videojuego,titulo,puntuacion,clasificacion,fecha_de_lanzamiento,beneficio_preorden,mensualidad,nombre
0,15,Fallout 3,86.43,Eighteen,27/10/2008,ninguno,NaN,Supervivencia
1,15,Fallout 3,86.43,Eighteen,27/10/2008,ninguno,NaN,Accion
2,15,Fallout 3,86.43,Eighteen,27/10/2008,ninguno,NaN,Supervivencia
3,15,Fallout 3,86.43,Eighteen,27/10/2008,ninguno,NaN,Accion
4,16,Fallout: New Vegas,84.59,M,18/10/2010,ninguno,NaN,Accion

# BCNF:

### generos:

In [251]:
df_subgenero = df_genero.dropna()
new_genre = df_genero[df_genero['subgenero'].isna()].drop(columns=['subgenero'])

New genero

In [252]:
new_genre.head()

                      genero
0                     Guerra
1  Turn-based strategy (TBS)
2                    Comedia
3                      Drama
4                     Sigilo

Sub genero

In [253]:
df_subgenero.head()

        genero                 subgenero
7       Horror                  Thriller
22    Misterio                  Thriller
23  Estrategia  Real Time Strategy (RTS)

### pagos:

In [254]:
data_pago = df_pagos[['pago_id', 'monto', 'fecha']]
df_pagos = df_pagos.drop(columns=['monto', 'fecha'])

In [281]:
data_pago

      pago_id  monto       fecha
0        4643   9100   12/5/2020
1        5081   9100   20/6/2021
2        5109   9100    5/1/2021
3        3961   9100    3/3/2021
4        4024   9100  16/10/2020
...       ...    ...         ...
6362     2128   6500    1/4/2021
6363      547   5500  21/11/2021
6364     1650   3000   12/5/2021
6365      799   5000    6/9/2021
6366     3475   4000  16/10/2021

[6367 rows x 3 columns]

In [290]:
df_pagos_subs = df_pagos.dropna(subset=['subs_id']).drop(columns=['preorden', 'id_proveedor', 'id_videojuego'])
df_pagos_nosub = df_pagos.dropna(subset=['preorden']).drop(columns=['subs_id'])

df_preorden = df_pagos_nosub[df_pagos_nosub['preorden']].drop(columns=['preorden'])
df_nopreorden = df_pagos_nosub[df_pagos_nosub['preorden'] == False].drop(columns=['preorden'])

In [293]:
df_nopreorden

      pago_id  id_usuario  id_proveedor  id_videojuego
0        4643         106           3.0           15.0
1        5081          82           3.0           15.0
2        5109          83           3.0           15.0
3        3961         125           3.0           15.0
4        4024          89           3.0           15.0
...       ...         ...           ...            ...
2881     5864          45           5.0        25076.0
2882     5614         134           5.0        25076.0
2883     5015         121           5.0        25076.0
2884     3672         109           5.0        25076.0
2885     4176         112           5.0        25076.0

[2608 rows x 4 columns]

In [285]:
df_pagos_nosub

      pago_id  id_usuario preorden  id_proveedor  id_videojuego
0        4643         106    False           3.0           15.0
1        5081          82    False           3.0           15.0
2        5109          83    False           3.0           15.0
3        3961         125    False           3.0           15.0
4        4024          89    False           3.0           15.0
...       ...         ...      ...           ...            ...
2881     5864          45    False           5.0        25076.0
2882     5614         134    False           5.0        25076.0
2883     5015         121    False           5.0        25076.0
2884     3672         109    False           5.0        25076.0
2885     4176         112    False           5.0        25076.0

[2886 rows x 5 columns]

### proveedores

In [256]:
df_prov = df_proveedores[['id', 'nombre', 'plataforma']].drop_duplicates().sort_values('id')
df_proveedores = df_proveedores.drop(columns=['nombre', 'plataforma'])
df_prov

     id             nombre   plataforma
0     1         Epic Games           PC
243   2              Steam           PC
63    3                GOG           PC
146   4  PlayStation Store  PlayStation
299   5   Xbox Games Store         Xbox
121   6     Nintendo eShop     Nintendo

In [275]:
df_precio = df_proveedores[df_proveedores['precio_preorden'].isna()].drop(columns=['precio_preorden'])
df_noprecio = df_precio[df_precio['precio'].isna()][['id', 'id_videojuego']]
df_precio = df_precio.dropna()
df_precio

     id  id_videojuego   precio
0     1             16  32000.0
4     1             37  18000.0
5     1             38   7000.0
6     1             40   5250.0
8     1             71  24400.0
..   ..            ...      ...
369   5           7599  57200.0
370   5           8173  54000.0
374   5          11198  20250.0
375   5          12517   9200.0
377   5          25076  44200.0

[248 rows x 3 columns]

In [276]:
df_noprecio

     id  id_videojuego
1     1             18
2     1             20
20    1            239
25    1            493
26    1            498
..   ..            ...
359   5           2031
363   5           5503
371   5           9630
372   5           9730
376   5          17000

[68 rows x 2 columns]

In [258]:
df_precio_pre = df_proveedores.dropna(subset=['precio_preorden'])
df_precio_pre

     id  id_videojuego   precio  precio_preorden
3     1             21  39200.0          43120.0
7     1             59  23600.0          25960.0
11    1             75  47450.0          52195.0
12    1            109  27450.0          30195.0
18    1            231  14850.0          16335.0
..   ..            ...      ...              ...
337   5            622  41800.0          45980.0
339   5            673  34450.0          37895.0
343   5            733   4500.0           4950.0
366   5           7342  40250.0          44275.0
373   5          11133  68250.0          75075.0

[62 rows x 4 columns]

### Subscripciones

In [259]:
df_subs_cancel = df_subscripciones[df_subscripciones['estado'] == 'canceled']
df_subs_active = df_subscripciones[df_subscripciones['estado'] == 'active']

In [274]:
df_subs_cancel

,id,estado,fecha_inicio,id_usuario,fecha_termino,id_videojuego,mensualidad
0,52,canceled,10/6/2020,127,8/7/2020,498,5000
1,335,canceled,17/6/2020,129,31/7/2020,731,9500
2,328,canceled,25/5/2020,78,1/8/2020,9630,5000
3,105,canceled,23/5/2020,93,8/9/2020,549,4000
4,74,canceled,17/7/2020,89,13/10/2020,126,6500
...,...,...,...,...,...,...,...
93,112,canceled,2/12/2021,79,19/12/2023,26758,7000
94,181,canceled,19/12/2021,47,19/12/2023,74,4000
95,238,canceled,24/9/2021,136,19/12/2023,230,7500
96,44,canceled,16/12/2021,107,19/12/2023,1384,6500
97,96,canceled,3/12/2021,54,20/12/2023,74,4000

### Usuario_actividades

In [260]:
df_usuario = df_usuario_actividades[['id_usuario', 'nombre', 'mail', 'password', 'username']]

In [261]:
data_users = df_usuario_actividades[['id_usuario', 'nombre', 'mail', 'password', 'username']].drop_duplicates()
df_usuario_actividades = df_usuario_actividades.drop(columns=['nombre', 'mail', 'password', 'username'])
data_users

,id_usuario,nombre,mail,password,username
0,9,Jeffrey Aguirre,jaguirre@yahoo.it,dL1lawrd,jaguirre1971
41,10,Antonio Shaw,ashaw@icloud.com,qSOfdTgQ,ashaw1989
70,11,Michael Marshall,mmarshall@yahoo.es,JAteLxYq,mmarshall1982
116,12,Steven Sullivan,ssullivan@yahoo.com,oSCRZPnt,ssullivan1988
149,13,John Wade,jwade@gmail.com,Uua8Ljit,jwade1974
...,...,...,...,...,...
3262,146,John Wade,jwade@icloud.com,ENjqJ0g3,jwade1981
3312,147,Barbara Sanchez,bsanchez@yahoo.com,zeW5Pha5,bsanchez1994
3333,148,Mario Shepard,mshepard@hotmail.com,3vVZGIhO,mshepard1995
3371,149,Amanda Robertson,arobertson@yahoo.it,eXCXIleM,arobertson1963
3397,150,Jared Pratt,jpratt@yahoo.it,kcQDLiw5,jpratt1973

In [262]:
df_us_id = data_users[["id_usuario", "username"]]
df_us_id

      id_usuario        username
0              9    jaguirre1971
41            10       ashaw1989
70            11   mmarshall1982
116           12   ssullivan1988
149           13       jwade1974
...          ...             ...
3262         146       jwade1981
3312         147    bsanchez1994
3333         148    mshepard1995
3371         149  arobertson1963
3397         150      jpratt1973

[100 rows x 2 columns]

In [263]:
data_users.drop(columns=["username"], inplace=True)
data_users

      id_usuario            nombre                  mail  password
0              9   Jeffrey Aguirre     jaguirre@yahoo.it  dL1lawrd
41            10      Antonio Shaw      ashaw@icloud.com  qSOfdTgQ
70            11  Michael Marshall    mmarshall@yahoo.es  JAteLxYq
116           12   Steven Sullivan   ssullivan@yahoo.com  oSCRZPnt
149           13         John Wade       jwade@gmail.com  Uua8Ljit
...          ...               ...                   ...       ...
3262         146         John Wade      jwade@icloud.com  ENjqJ0g3
3312         147   Barbara Sanchez    bsanchez@yahoo.com  zeW5Pha5
3333         148     Mario Shepard  mshepard@hotmail.com  3vVZGIhO
3371         149  Amanda Robertson   arobertson@yahoo.it  eXCXIleM
3397         150       Jared Pratt       jpratt@yahoo.it  kcQDLiw5

[100 rows x 4 columns]

Falta reseña y horas

In [264]:
df_resena = df_usuario_actividades.dropna(subset=['titulo'])
df_resena.drop(columns=["fecha_nacimiento", "fecha v"], inplace=True)
df_resena

C:\Users\vicen\AppData\Local\Temp\ipykernel_9736\1939521730.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_resena.drop(columns=["fecha_nacimiento", "fecha v"], inplace=True)

,id_usuario,id_videojuego,cantidad,veredicto,titulo,texto
7,9,126.0,308.0,negativo,Muy Malo,Este juego viene directamente de Mordor
33,9,6036.0,73.0,negativo,Y pensar que me perd√≠ la boda de mi hija por ...,Nooo el juego
39,9,26758.0,224.0,positivo,No me calza el precio con la calidad del juego...,Todos hablan del New World pero no tienen ni i...
43,10,74.0,600.0,positivo,No me calza el precio con la calidad del juego...,No entiendo el motivo por el cual no han sacad...
112,11,11208.0,121.0,negativo,Em... ten√≠a final el juego?,M√°s malo que la pizza helada
...,...,...,...,...,...,...
3338,148,239.0,483.0,positivo,M√°s bueno que el pan con chancho,Horas de diversi√≥n para amigos y familia
3341,148,375.0,204.0,negativo,Peor juego,Muy malo
3357,148,2031.0,589.0,negativo,No entiendo por qu√© no regalan este juego,No logr√© comprender la idea del juego
3433,150,1068.0,581.0,positivo,"Si este juego fuera One Piece, me ver√≠a los 1...","Consistente, repleto de contenido, soprendente..."
3445,150,6036.0,620.0,positivo,Vine buscando cobre y encontr√© oro,Todos hablan del New World pero no tienen ni i...

In [265]:
df_noresena = df_usuario_actividades[df_usuario_actividades['titulo'].isna()].drop(columns=['veredicto', 'titulo', 'texto', 'fecha_nacimiento']).dropna()
df_noresena

      id_usuario  id_videojuego     fecha v  cantidad
0              9           15.0  13/05/2021      0.75
1              9           16.0  10/06/2020      1.50
2              9           37.0  04/02/2021      4.25
3              9           43.0  28/06/2021     52.00
4              9           71.0  20/01/2021      1.75
...          ...            ...         ...       ...
3450         150         7351.0  18/07/2021      2.75
3451         150         8173.0  31/01/2020     24.00
3452         150        11198.0  24/05/2021      4.50
3453         150        12517.0  27/06/2020     90.00
3454         150        14593.0  12/05/2020      2.25

[3257 rows x 4 columns]

### Usuario - Proveeddor,  Videojuego - Genero : Está en BCNF

### Videojuego:

In [266]:
data_videojuego = df_videojuego[['id_videojuego', 'titulo', 'puntuacion', 'clasificacion', 'fecha_de_lanzamiento']].drop_duplicates()
data_videojuego

,id_videojuego,titulo,puntuacion,clasificacion,fecha_de_lanzamiento
0,15,Fallout 3,86.43,Eighteen,27/10/2008
4,16,Fallout: New Vegas,84.59,M,18/10/2010
5,18,Max Payne,80.20,M,22/7/2001
6,20,BioShock,89.99,M,20/8/2007
10,21,BioShock 2,83.96,Eighteen,2/8/2010
...,...,...,...,...,...
206,17000,Stardew Valley,89.11,E10,25/2/2016
210,19560,God of War,95.98,M,19/4/2018
211,19565,Marvel's Spider-Man,88.84,T,9/6/2018
212,25076,Red Dead Redemption 2,93.39,M,25/10/2018
213,26758,Super Mario Odyssey,93.26,E10,26/10/2017

In [267]:
videjuego_genero = df_videojuego[["id_videojuego", "nombre"]]
videjuego_genero.drop_duplicates(inplace=True)
videjuego_genero

C:\Users\vicen\AppData\Local\Temp\ipykernel_9736\680422224.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  videjuego_genero.drop_duplicates(inplace=True)

     id_videojuego         nombre
0               15  Supervivencia
1               15         Accion
4               16         Accion
5               18         Accion
6               20     Historicos
..             ...            ...
207          17000            RPG
210          19560       Aventura
211          19565          Drama
212          25076            FPS
213          26758        Sandbox

[150 rows x 2 columns]

In [268]:
data_videojuego.head()

,id_videojuego,titulo,puntuacion,clasificacion,fecha_de_lanzamiento
0,15,Fallout 3,86.43,Eighteen,27/10/2008
4,16,Fallout: New Vegas,84.59,M,18/10/2010
5,18,Max Payne,80.20,M,22/7/2001
6,20,BioShock,89.99,M,20/8/2007
10,21,BioShock 2,83.96,Eighteen,2/8/2010

In [269]:
df_videojuego = df_videojuego[['id_videojuego', 'beneficio_preorden', 'mensualidad']].drop_duplicates()
df_vid_ben = df_videojuego.dropna(subset=['beneficio_preorden']).drop(columns=['mensualidad'])
df_vid_mesual = df_videojuego[df_videojuego['beneficio_preorden'].isna()].drop(columns=['beneficio_preorden'])

In [270]:
df_vid_ben

     id_videojuego             beneficio_preorden
0               15                        ninguno
4               16                        ninguno
10              21  contenido adicional exclusivo
14              37                        ninguno
15              38                        ninguno
..             ...                            ...
201          12517                        ninguno
205          14593                        ninguno
210          19560                        ninguno
211          19565             elementos visuales
212          25076                        ninguno

[93 rows x 2 columns]

In [271]:
df_vid_mesual

     id_videojuego  mensualidad
5               18       5000.0
6               20       8000.0
29              74       4000.0
31              76       9500.0
43             126       6500.0
47             230       7500.0
53             239       5000.0
58             375       9500.0
74             493       8000.0
75             498       5000.0
93             549       4000.0
104            731       9500.0
128           1068       6500.0
129           1070       5500.0
130           1074       8500.0
147           1384       6500.0
157           2031       5000.0
165           5503       5000.0
166           6036       3500.0
179           7334       4500.0
192           9630       5000.0
196           9730       6500.0
200          11208       3000.0
206          17000       5500.0
213          26758       7000.0